---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ColumnAttachment
source: html/76c1c3cf-61cd-1c12-c629-6fb6650fa467.htm
---
# ColumnAttachment Members

Attaches the column to the target. If an attachment already
 exists with the same "baseOrTop" value, no attachment is made.